#include QMK_KEYBOARD_H
// #ifdef SSD1306OLED
//     #include "ssd1306.h"
// #endif
extern uint8_t is_master;

#define CTL_GRV LCTL_T(KC_GRV)

// layers ----------------------------------------------------------------------

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

    /* layer: base
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  E  ├─────┐                          ┌─────┤  I  ├─────┐
     * ┌─────┬─────┤  W  ├─────┤  R  ├─────┐              ┌─────┤  U  ├─────┤  O  ├─────┬─────┐
     * │ esc │  Q  ├─────┤  D  ├─────┤  T  │              │  Y  ├─────┤  K  ├─────┤  P  │ bsp │
     * ├─────┼─────┤  S  ├─────┤  F  ├─────┤              ├─────┤  J  ├─────┤  L  ├─────┼─────┤
     * │shift│  A  ├─────┤  C  ├─────┤  G  │              │  H  ├─────┤  ,  ├─────┤  ;  │  '  │
     * ├─────┼─────┤  X  ├─────┤  V  ├─────┤              ├─────┤  M  ├─────┤  .  ├─────┼─────┤
     * │`/ctl│  Z  ├─────┘     └─────┤  B  │              │  N  ├─────┘     └─────┤  /  │ del │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ OS  │┌─────┐┌─────┐    ┌─────┐┌─────┐│ alt │
     *                      └─────┘│ fn2 ││space│    │enter││ fn1 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [0] = LAYOUT(
        KC_ESC,  KC_Q, KC_W, KC_E,    KC_R,  KC_T,   KC_Y,   KC_U,  KC_I,    KC_O,   KC_P,    KC_BSPC,
        KC_LSFT, KC_A, KC_S, KC_D,    KC_F,  KC_G,   KC_H,   KC_J,  KC_K,    KC_L,   KC_SCLN, KC_QUOT,
        CTL_GRV, KC_Z, KC_X, KC_C,    KC_V,  KC_B,   KC_N,   KC_M,  KC_COMM, KC_DOT, KC_SLSH, KC_DEL,
                             KC_LGUI, MO(2), KC_SPC, KC_ENT, MO(1), KC_LALT
    ),

    /* layer: fn1
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  3  ├─────┐                          ┌─────┤  8  ├─────┐
     * ┌─────┬─────┤  2  ├─────┤  4  ├─────┐              ┌─────┤  7  ├─────┤  9  ├─────┬─────┐
     * │ esc │  1  ├─────┤  6  ├─────┤  5  │              │  6  ├─────┤down ├─────┤  0  │ bsp │
     * ├─────┼─────┤  5  ├─────┤  .  ├─────┤              ├─────┤left ├─────┤ up  ├─────┼─────┤
     * │shift│  4  ├─────┤  9  ├─────┤     │              │     ├─────┤pgdwn├─────┤right│     │
     * ├─────┼─────┤  8  ├─────┤  0  ├─────┤              ├─────┤ end ├─────┤pgup ├─────┼─────┤
     * │ctl  │  7  ├─────┘     └─────┤     │              │     ├─────┘     └─────┤home │ tab │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ OS  │┌─────┐┌─────┐    ┌─────┐┌─────┐│ alt │
     *                      └─────┘│-----││space│    │enter││ fn3 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [1] = LAYOUT(
        KC_ESC,  KC_1, KC_2, KC_3,    KC_4,    KC_5,    KC_6,    KC_7,    KC_8,    KC_9,    KC_0,    KC_BSPC,
        KC_LSFT, KC_4, KC_5, KC_6,    KC_DOT, XXXXXXX, XXXXXXX, KC_LEFT, KC_DOWN, KC_UP,   KC_RGHT, XXXXXXX,
        KC_LCTL, KC_7, KC_8, KC_9,    KC_0,    XXXXXXX, XXXXXXX, KC_END,  KC_PGDN, KC_PGUP, KC_HOME, KC_TAB,
                             KC_LGUI, MO(3), KC_SPC,  KC_ENT,  _______,   KC_RALT
    ),

    /* layer: fn2
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  #  ├─────┐                          ┌─────┤  *  ├─────┐
     * ┌─────┬─────┤  @  ├─────┤  $  ├─────┐              ┌─────┤  &  ├─────┤  (  ├─────┬─────┐
     * │ esc │  !  ├─────┤  #  ├─────┤  %  │              │  ^  ├─────┤  [  ├─────┤  )  │ bsp │
     * ├─────┼─────┤  $  ├─────┤     ├─────┤              ├─────┤  =  ├─────┤  ]  ├─────┼─────┤
     * │shift│  @  ├─────┤     ├─────┤     │              │  -  ├─────┤  {  ├─────┤  \  │  ~  │
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤  +  ├─────┤  }  ├─────┼─────┤
     * │ctrl │     ├─────┘     └─────┤     │              │  _  ├─────┘     └─────┤  |  │ tab │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ OS  │┌─────┐┌─────┐    ┌─────┐┌─────┐│ alt │
     *                      └─────┘│ fn3 ││space│    │enter││-----│└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [2] = LAYOUT(
        KC_ESC,  KC_EXLM, KC_AT,   KC_HASH, KC_DLR,  KC_PERC, KC_CIRC, KC_AMPR, KC_ASTR, KC_LPRN, KC_RPRN, KC_BSPC,
        KC_LSFT, KC_AT,   KC_DLR,  KC_HASH, XXXXXXX, XXXXXXX, KC_MINS, KC_EQL,  KC_LBRC, KC_RBRC, KC_BSLS, KC_TILD,
        KC_LCTL, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, KC_UNDS, KC_PLUS, KC_LCBR, KC_RCBR, KC_PIPE, KC_TAB,
                                   KC_LGUI, _______,   KC_SPC,  KC_ENT,  MO(3), KC_RALT
    ),

    /* layer: fn3 (fn1 + fn2)
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤ F4  ├─────┐                          ┌─────┤ F9  ├─────┐
     * ┌─────┬─────┤ F3  ├─────┤ F5  ├─────┐              ┌─────┤ F8  ├─────┤ F10 ├─────┬─────┐
     * │ F1  │ F2  ├─────┤prev ├─────┤ F6  │              │ F7  ├─────┤     ├─────┤ F11 │ F12 │
     * ├─────┼─────┤play ├─────┤next ├─────┤              ├─────┤     ├─────┤     ├─────┼─────┤
     * │     │     ├─────┤vol- ├─────┤     │              │     ├─────┤     ├─────┤     │     │
     * ├─────┼─────┤mute ├─────┤vol+ ├─────┤              ├─────┤     ├─────┤     ├─────┼─────┤
     * │     │     ├─────┘     └─────┤     │              │     ├─────┘     └─────┤     │reset│
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ OS  │┌─────┐┌─────┐    ┌─────┐┌─────┐│ alt │
     *                      └─────┘│-----││space│    │enter││-----│└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [3] = LAYOUT(
        KC_F1,   KC_F2,   KC_F3,   KC_F4,   KC_F5,   KC_F6,   KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_F11,  KC_F12,
        XXXXXXX, KC_MPLY, KC_MPRV, KC_MNXT, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX,
        XXXXXXX, KC_MUTE, KC_VOLD, KC_VOLU, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, RESET,
                                   KC_LGUI, _______, KC_SPC,  KC_ENT,  _______, KC_LALT
    )
};

// misc ------------------------------------------------------------------------

// void matrix_init_user(void) {
//     #ifdef SSD1306OLED
//         iota_gfx_init(!has_usb()); // turns on the display
//     #endif
// }

// SSD1306 OLED screen ---------------------------------------------------------

// #ifdef SSD1306OLED
//     const char *read_default_layer_state(void);
//     const char *read_layer_state(void);
//     const char *read_logo(void);

//     void matrix_scan_user(void) {
//        iota_gfx_task();
//     }

//     void matrix_render_user(struct CharacterMatrix *matrix) {
//         if (is_master) {
//             matrix_write_ln(matrix, read_default_layer_state());
//             matrix_write_ln(matrix, read_layer_state());
//         } else {
//             matrix_write(matrix, read_logo());
//         }
//     }

//     void matrix_update(struct CharacterMatrix *dest, const struct CharacterMatrix *source) {
//         if (memcmp(dest->display, source->display, sizeof(dest->display))) {
//             memcpy(dest->display, source->display, sizeof(dest->display));
//             dest->dirty = true;
//         }
//     }

//     void iota_gfx_task_user(void) {
//         struct CharacterMatrix matrix;
//         matrix_clear(&matrix);
//         matrix_render_user(&matrix);
//         matrix_update(&display, &matrix);
//     }
// #endif

// SSD1306 OLED screen ---------------------------------------------------------

#ifdef OLED_DRIVER_ENABLE
    static void render_logo(void) {
        static const char PROGMEM my_logo[] = {
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x80, 0xc0, 
            0x60, 0x60, 0x30, 0x30, 0x10, 0x18, 0x18, 0x18, 0x18, 0x18, 0x98, 0xd8, 0x58, 0x78, 0x10, 0x30, 
            0x30, 0x20, 0x60, 0x60, 0xc0, 0xc0, 0x80, 0x00, 0x80, 0xc0, 0xc0, 0x40, 0x40, 0x60, 0x60, 0x60, 
            0x40, 0x40, 0x40, 0xc0, 0x80, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xc0, 0xe0, 0xb8, 0x8c, 0x86, 0x83, 0x01, 0x03, 
            0xc6, 0xfc, 0x8c, 0x04, 0x04, 0x04, 0x06, 0x06, 0x07, 0x8d, 0x89, 0xf8, 0x30, 0x00, 0x10, 0x90, 
            0x88, 0xbc, 0xf4, 0xe2, 0x7b, 0x1d, 0x0f, 0x03, 0x01, 0x00, 0x00, 0x00, 0xe0, 0x30, 0x14, 0xf6, 
            0xf2, 0xf2, 0xe0, 0x00, 0x01, 0x03, 0x07, 0x0e, 0x7c, 0xe0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x06, 0x07, 0x0f, 0xfe, 0x3e, 0x0e, 0x0e, 0x0e, 0x0e, 0x1e, 
            0x3e, 0xf7, 0x85, 0x85, 0xc7, 0xf7, 0x3f, 0x0d, 0x0d, 0x05, 0x0d, 0x0d, 0xfd, 0xfb, 0x1f, 0x1f, 
            0x1f, 0x1f, 0x99, 0x90, 0xb0, 0xf0, 0x60, 0xe0, 0x60, 0xc0, 0xc0, 0x80, 0x87, 0x0c, 0x0c, 0x0c, 
            0x0c, 0x07, 0x01, 0x00, 0x00, 0x00, 0x80, 0xc0, 0x70, 0x3f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x07, 0x1f, 0x18, 0x18, 0x18, 0x18, 0x1c, 0x10, 
            0x1c, 0x1f, 0x0d, 0x07, 0x0f, 0x1d, 0x18, 0x18, 0x18, 0x08, 0x1c, 0x1c, 0x1f, 0x1f, 0x01, 0x01, 
            0x03, 0x07, 0x05, 0x05, 0x0c, 0x0e, 0x0c, 0x03, 0x00, 0x00, 0x00, 0x01, 0x01, 0x03, 0x03, 0x03, 
            0x03, 0x06, 0x06, 0x02, 0x02, 0x03, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
            0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
        };
  oled_write_raw_P(my_logo, sizeof(my_logo));
}

void oled_task_user(void) {
  if (is_keyboard_master()) {
    // If you want to put your image on the master side, put your function call here:
    render_logo();
  } else {
    // And if you want to put your image on the slave side, put it here instead:
    render_logo();
  }
}
#endif
